#!/usr/bin/python3

"""
Напишите программу, которая находит полное число метров по заданному числу сантиметров.
"""

# Задача
"""
345

3
"""

# Решение
print(int(input()) // 100)
