#!/usr/bin/python3

"""
В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом.
Напишите программу, которая определяет номер купе, в котором
находится место с заданным номером (нумерация мест сквозная, начинается с 1).
"""

# Задача
"""
1

1
"""

# Решение
print((int(input()) + 3) // 4)