#!/usr/bin/python3

"""
На вход программе подаётся строка текста – имя человека.
Напишите программу, которая принимает эту строку текста через стандартный поток ввода
(команда input()). Далее программа должна выводить на экран приветствие в следующем формате:

Привет, <имя человека>
"""

# Задача
"""
Привет, <имя человека>
"""

# Решение
print('Привет,', input())
