#!/usr/bin/python3

"""
Измените предыдущую программу так, чтобы каждое число последовательности
4 8 15 16 23 42 печаталось на отдельной строке.
"""

# Задача
"""
4
8
15
16
23
42
"""

# Решение
print('4', '8', '15', '16', '23', '42', sep='\n')
