#!/usr/bin/python3

"""
Напишите программу, которая принимает через стандартный поток ввода
(команда input()) три строки, а затем выводит их в той же последовательности,
каждую на отдельной строке.
"""

# Задача
"""
<строка1>
<строка2>
<строка3>
"""

# Решение
print(input(), input(), input(), sep='\n')
