#!/usr/bin/python3

"""
На вход программе подается строка текста – название футбольной команды.
Напишите программу, которая принимает через стандартный поток ввода
(команда input()) эту строку и печатает предложение в следующем формате:

<название футбольной команды> - чемпион!
"""

# Задача
"""
<название футбольной команды> - чемпион!
"""

# Решение
print(input(), '- чемпион!')
