#!/usr/bin/python3

"""
Напишите программу, которая принимает целое число
x и определяет, принадлежит ли данное число указанным промежуткам.
"""

# Задача
"""
x = ~ -3^ ; 7^ ~

Принадлежит
"""

# Решение
print('Принадлежит' if int(input()) not in range(-2, 7) else 'Не принадлежит')