#!/usr/bin/python3

"""
Напишите программу, которая приветствует пользователя в следующем формате:

Привет, <имя пользователя>!
"""

# Задача
"""
Привет, <имя пользователя>!
"""

# Решение
print('Привет, ', end=input() + '!')

