#!/usr/bin/python3

"""
Напишите программу, которая выводит на экран следующий текст:

I***like***Python
"""

# Задача
"""
I***like***Python
"""

# Решение
print('I', 'like', 'Python', sep='***')

