#!/usr/bin/python3

"""
Напишите программу, которая определяет наименьшее из двух чисел.
"""

# Задача
"""
8
11

8
"""

# Решение
print(min(int(input()) for i in range(2)))