#!/usr/bin/python3

"""
Напишите программу, которая определяет, является число четным или нечетным.
"""

# Задача
"""
10

Четное
"""

# Решение
print('Четное' if int(input()) % 2 == 0 else 'Нечетное')