#!/usr/bin/python3

"""
Напишите программу, которая определяет наименьшее из четырёх чисел.
"""

# Задача
"""
1
2
3
4

1
"""

# Решение
print(min(int(input()) for i in range(4)))